app/controllers/parks_controller.rb

  def index
    @parks = Park.all
---
SELECT "parks".* FROM "parks"

  def show
    @park = Park.find(params[:id])
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def create
    @park = Park.create(park_params)
---
INSERT INTO "parks" ("park_name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["park_name", "Cal Anderson"], ["location", "Seattle"], ["created_at", "2017-07-21 16:05:34.494306"], ["updated_at", "2017-07-21 16:05:34.494306"]]

  def update
    @park = Park.find(params[:id])
    @park.update(park_params)
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "parks" SET "park_name" = $1, "location" = $2, "updated_at" = $3 WHERE "parks"."id" = $4  [["park_name", "Mack Park"], ["location", "Tohoma"], ["updated_at", "2017-07-21 20:11:41.873744"], ["id", 21]]

  def destroy
    @park = Park.find(params[:id])
    @park.destroy
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "parks" WHERE "parks"."id" = $1  [["id", 23]]